In [ ]:
Part 1: Yelp Dataset Profiling and Understanding

1. Profile the data by finding the total number of records for each of the tables below:
	
i. Attribute table = 10000
ii. Business table = 10000
iii. Category table = 10000
iv. Checkin table = 10000
v. elite_years table = 10000
vi. friend table = 10000
vii. hours table = 10000
viii. photo table = 10000
ix. review table = 10000
x. tip table = 10000
xi. user table = 10000

In [ ]:
#i. Attribute table = 10000

SELECT COUNT(*) FROM attribute

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
ii. Business table = 10000

SELECT COUNT(*) FROM business

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
iii. Category table = 10000


SELECT COUNT(*) FROM category

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
iv. Checkin table = 10000

SELECT COUNT(*) FROM checkin

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
v. elite_years table = 10000

SELECT COUNT(*) FROM elite_years

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
vi. friend table = 10000

SELECT COUNT(*) FROM friend

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
vii. hours table = 10000

SELECT COUNT(*) FROM hours
+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
viii. photo table = 10000

SELECT COUNT(*) FROM photo

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
ix. review table = 10000

SELECT COUNT(*) FROM review

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
x. tip table = 10000

SELECT COUNT(*) FROM tip
+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

xi. user table = 10000

SELECT COUNT(*) FROM user

+----------+
| COUNT(*) |
+----------+
|    10000 |
+----------+

In [ ]:
2. Find the total distinct records by either the foreign key or primary key for each table. If two foreign keys are listed in the table, please specify which foreign key.

i. Business =
ii. Hours =
iii. Category =
iv. Attribute =
v. Review =
vi. Checkin = 
vii. Photo =
viii. Tip = 
ix. User = 
x. Friend = 
xi. Elite_years =

In [ ]:

i. Business = 10000

SELECT COUNT(DISTINCT ID) FROM Business 

+--------------------+
| COUNT(DISTINCT ID) |
+--------------------+
|              10000 |
+--------------------+

In [ ]:
ii. Hours = 1562


SELECT COUNT(DISTINCT business_id) FROM hours 
Reset
+-----------------------------+
| COUNT(DISTINCT business_id) |
+-----------------------------+
|                        1562 |
+-----------------------------+

In [ ]:
iii. Category = 2643

SELECT COUNT(DISTINCT business_id) FROM category 

+-----------------------------+
| COUNT(DISTINCT business_id) |
+-----------------------------+
|                        2643 |
+-----------------------------+

In [ ]:
iv. Attribute = 1115

SELECT COUNT(DISTINCT business_id) FROM attribute 

+-----------------------------+
| COUNT(DISTINCT business_id) |
+-----------------------------+
|                        1115 |
+-----------------------------+

In [ ]:
v. Review = 10000

SELECT COUNT( id) FROM review 
+------------+
| COUNT( id) |
+------------+
|      10000 |
+------------+

In [ ]:
vi. Checkin = 493

SELECT COUNT(DISTINCT business_id) FROM checkin 

+-----------------------------+
| COUNT(DISTINCT business_id) |
+-----------------------------+
|                         493 |
+-----------------------------+

In [ ]:
vii. Photo = 10000

SELECT COUNT(id) FROM photo 
+------------+
| COUNT( id) |
+------------+
|      10000 |
+------------+

In [ ]:
viii. Tip = 1) 537 according to DISTINCT user_id 
            2) 3979 according to DISTINCT business_id

##FK 1 
SELECT COUNT(DISTINCT user_id) FROM tip 
+-------------------------+
| COUNT(DISTINCT user_id) |
+-------------------------+
|                     537 |
+-------------------------+



# the other FK  
SELECT COUNT(DISTINCT business_id) FROM tip 
+-----------------------------+
| COUNT(DISTINCT business_id) |
+-----------------------------+
|                        3979 |
+-----------------------------+

In [ ]:
ix. User = 10000

SELECT COUNT(id) FROM user 
+-----------+
| COUNT(id) |
+-----------+
|     10000 |
+-----------+

In [ ]:
x. Friend = 11
SELECT COUNT(DISTINCT user_id) FROM friend 
+-------------------------+
| COUNT(DISTINCT user_id) |
+-------------------------+
|                      11 |
+-------------------------+

In [ ]:
xi. Elite_years = 2780


SELECT COUNT(DISTINCT user_id) FROM Elite_years 
+-------------------------+
| COUNT(DISTINCT user_id) |
+-------------------------+
|                    2780 |
+-------------------------+

In [ ]:

3. Are there any columns with null values in the Users table? Indicate "yes," or "no."

	Answer: NO
	
	
	SQL code used to arrive at answer:

SELECT * FROM User
WHERE compliment_photos  IS NULL 
OR compliment_writer IS NULL 
OR compliment_funny IS NULL 
OR compliment_cool IS NULL 
OR compliment_plain IS NULL 
OR compliment_note IS NULL 
OR compliment_list IS NULL 
OR compliment_cute IS NULL
OR compliment_profile IS NULL 
OR compliment_more IS NULL 
OR compliment_hot IS NULL 
OR average_stars IS NULL 
OR fans IS NULL 
OR cool IS NULL 
OR funny  IS NULL 
OR useful IS NULL 
OR yelping_since IS NULL 
OR review_count IS NULL 
OR name IS NULL 
OR id IS NULL

In [ ]:
	
4. For each table and column listed below, display the smallest (minimum), largest (maximum), and average (mean) value for the following fields:

	i. Table: Review, Column: Stars
	
		min: 1	max: 5	avg: 3.7082
        
SELECT MIN(Stars) , MAX(Stars) , AVG(Stars) FROM Review
+------------+------------+------------+
| MIN(Stars) | MAX(Stars) | AVG(Stars) |
+------------+------------+------------+
|          1 |          5 |     3.7082 |
+------------+------------+------------+

		+------------+------------+------------++------------+------------+------------+

	
	ii. Table: Business, Column: Stars
	
		min: 1.0 		max: 5.0		avg:  3.6549
		
 SELECT MIN(Stars) , MAX(Stars) , AVG(Stars) FROM Business
+------------+------------+------------+
| MIN(Stars) | MAX(Stars) | AVG(Stars) |
+------------+------------+------------+
|        1.0 |        5.0 |     3.6549 |
+------------+------------+------------+


		+------------+------------+------------++------------+------------+------------+

	iii. Table: Tip, Column: Likes
	
		min: 0		max: 2		avg: 0.0144
		
        
SELECT MIN(Likes) , MAX(Likes) , AVG(Likes) FROM tip
+------------+------------+------------+
| MIN(Likes) | MAX(Likes) | AVG(Likes) |
+------------+------------+------------+
|          0 |          2 |     0.0144 |
+------------+------------+------------+


		+------------+------------+------------++------------+------------+------------+

	iv. Table: Checkin, Column: Count
	
		min: 1 		max: 53		avg: 1.9414
        
SELECT MIN(Count) , MAX(Count) , AVG(Count) FROM Checkin
+------------+------------+------------+
| MIN(Count) | MAX(Count) | AVG(Count) |
+------------+------------+------------+
|          1 |         53 |     1.9414 |
+------------+------------+------------+

        
        +------------+------------+------------++------------+------------+------------+

		
	
	v. Table: User, Column: Review_count
	
		min: 0		max: 2000		avg: 24.2995

SELECT MIN(Review_count) , MAX(Review_count) , AVG(Review_count) FROM user
+-------------------+-------------------+-------------------+
| MIN(Review_count) | MAX(Review_count) | AVG(Review_count) |
+-------------------+-------------------+-------------------+
|                 0 |              2000 |           24.2995 |
+-------------------+-------------------+-------------------+

In [ ]:
5. List the cities with the most reviews in descending order:

	SQL code used to arrive at answer:
    
SELECT city , SUM(review_count) AS review_count FROM business 
GROUP BY city
ORDER BY review_count DESC 
	
	
	Copy and Paste the Result Below:
+-----------------+--------------+
| city            | review_count |
+-----------------+--------------+
| Las Vegas       |        82854 |

In [ ]:
6. Find the distribution of star ratings to the business in the following cities:

i. Avon

SQL code used to arrive at answer:

SELECT stars , SUM(stars) AS COUNT
FROM business
WHERE city = 'Avon'
GROUP BY stars


Copy and Paste the Resulting Table Below (2 columns â€“ star rating and count):
+-------+-------+
| stars | COUNT |
+-------+-------+
|   1.5 |   1.5 |
|   2.5 |   5.0 |
|   3.5 |  10.5 |
|   4.0 |   8.0 |
|   4.5 |   4.5 |
|   5.0 |   5.0 |
+-------+-------+

        +------------+------------+------------++------------+------------+------------+


ii. Beachwood

SQL code used to arrive at answer:

SELECT stars , SUM(stars) AS COUNT
FROM business
WHERE city = 'Beachwood'
GROUP BY stars


Copy and Paste the Resulting Table Below (2 columns â€“ star rating and count):
		

+-------+-------+
| stars | COUNT |
+-------+-------+
|   2.0 |   2.0 |
|   2.5 |   2.5 |
|   3.0 |   6.0 |
|   3.5 |   7.0 |
|   4.0 |   4.0 |
|   4.5 |   9.0 |
|   5.0 |  25.0 |
+-------+-------+

In [ ]:

7. Find the top 3 users based on their total number of reviews:
		
	SQL code used to arrive at answer:
    
SELECT id , name , review_count
FROM user
ORDER BY review_count DESC 
LIMIT 3 
	
		
	Copy and Paste the Result Below:
    
+------------------------+--------+--------------+
| id                     | name   | review_count |
+------------------------+--------+--------------+
| -G7Zkl1wIWBBmD0KRy_sCw | Gerald |         2000 |
| -3s52C4zL_DHRK0ULG6qtg | Sara   |         1629 |
| -8lbUNlXVSoXqaRRiHiSNg | Yuri   |         1339 |
+------------------------+--------+--------------+

In [ ]:
8. Does posing more reviews correlate with more fans?

	Please explain your findings and interpretation of the results:
	
    
SELECT name , id , SUM(fans) , SUM(review_count) AS num_reviews , DATE(yelping_since) AS year 
FROM user 
GROUP BY year
ORDER BY year DESC , num_reviews DESC 


+------------+------------------------+-----------+-------------+------------+
| name       | id                     | SUM(fans) | num_reviews | year       |
+------------+------------------------+-----------+-------------+------------+
| Mo         | -KFzJzCpa0GLznAf69vEWg |         0 |           2 | 2017-07-26 |
| Rose       | -K3SfRRdT-PlmjMWNBh94g |         0 |           2 | 2017-07-25 |
| Luke       | -luD_MVs64DrIT6ZgbBgUQ |         0 |           4 | 2017-07-24 |
| Emile      | -iqmhG0_99mtLNdXkBzPyQ |         0 |           2 | 2017-07-23 |
| Babak      | -Lzl5USha5E3lzX6FOnRPQ |         0 |          12 | 2017-07-21 |
| Kris       | -bDGesl1ghyId02n5a7vuA |         0 |           1 | 2017-07-20 |
| James      | -HRvdYM7SIkkGcyB_oPJ7w |         0 |           3 | 2017-07-19 |
| Yushirah   | -krfY6paxElsnq72msaTkw |         0 |           2 | 2017-07-18 |
| Alan       | -GXkjLEMmJAMBkmKmwHgyg |         0 |           2 | 2017-07-17 |
| Jack       | -dxf_QBPOCKLHp7--UGkdw |         0 |           1 | 2017-07-16 |
| Karen      | -K55FNhrWKQVNmCIW7tPHw |         0 |           2 | 2017-07-15 |
| Kid        | -2JaWozmY9C4s0l0qqMkTg |         0 |           1 | 2017-07-14 |
| Thomas     | -hXEk7BiyN9VfEoU7e2Xtw |         0 |           9 | 2017-07-13 |
| Ymk        | -5VlEWvhGIBrHyDoLs5h2g |         0 |           5 | 2017-07-12 |
| Jacqueline | -dbvxAtzpew7TdhfzKOdWA |         0 |           4 | 2017-07-11 |
| Joseph     | -hK5DC8TG7aLWRDgRLertA |         0 |           2 | 2017-07-10 |
| Aaris      | -EpFpFDCGFQQxI_lsmGUSw |         1 |          48 | 2017-07-09 |
| Eva        | -JO8ReHdLDIeLVP8dvAZaQ |         1 |           6 | 2017-07-08 |
| Gail       | -jjD_H40FF18z94XKgJI8g |         0 |           3 | 2017-07-02 |
| Suzi       | -ldHxTXtXZf82CfIUQ7nOw |         0 |           2 | 2017-07-01 |
| Rosemary   | -HvPiUojZRtBomVutCUTvg |         0 |           1 | 2017-06-28 |
| Jillian    | -EkTTQBjU60d-Nfn1kACjA |         0 |           5 | 2017-06-27 |
| Brittany   | -kOz6o3Us4Ih047pFcrH_Q |         0 |           5 | 2017-06-26 |
| Nic        | -2LVjbw3pNGCPTlNx-5pYg |         0 |           1 | 2017-06-25 |
| Joann      | -iQAhjC8MkEEKdMsRLaxxQ |         0 |           2 | 2017-06-24 |
+------------+------------------------+-----------+-------------+------------+
(Output limit exceeded, 25 of 3212 total rows shown)

>> according to the previous query 

using the date column : 
 - there is no clear evidence that when the user post more reviews the number of fans will increase 
 because as shown there are many 0 as number of fans although there are numbers of reviews

In [ ]:
9. Are there more reviews with the word "love" or with the word "hate" in them?

	Answer: love , 1780 count

	
	SQL code used to arrive at answer:
    
SELECT COUNT(*) FROM review 
WHERE text LIKE '%love%'    

+----------+
| COUNT(*) |
+----------+
|     1780 |
+----------+


SELECT COUNT(*) FROM review 
WHERE text LIKE '%hate%'

+----------+
| COUNT(*) |
+----------+
|      232 |
+----------+

In [ ]:
	
10. Find the top 10 users with the most fans:

	SQL code used to arrive at answer:

SELECT id , name , SUM(fans) AS num_fans
FROM user 
GROUP BY id
ORDER BY num_fans DESC 
LIMIT 10
	
	
	Copy and Paste the Result Below:
+------------------------+-----------+----------+
| id                     | name      | num_fans |
+------------------------+-----------+----------+
| -9I98YbNQnLdAmcYfb324Q | Amy       |      503 |
| -8EnCioUmDygAbsYZmTeRQ | Mimi      |      497 |
| --2vR0DIsmQ6WfcSzKWigw | Harald    |      311 |
| -G7Zkl1wIWBBmD0KRy_sCw | Gerald    |      253 |
| -0IiMAZI2SsQ7VmyzJjokQ | Christine |      173 |
| -g3XIcCb2b-BD0QBCcq2Sw | Lisa      |      159 |
| -9bbDysuiWeo2VShFJJtcw | Cat       |      133 |
| -FZBTkAZEXoP7CYvRV2ZwQ | William   |      126 |
| -9da1xk7zgnnfO1uTVYGkA | Fran      |      124 |
| -lh59ko3dxChBSZ9U7LfUw | Lissa     |      120 |
+------------------------+-----------+----------+

In [ ]:
Part 2: Inferences and Analysis

1. Pick one city and category of your choice and group the businesses in that city or category by their overall star rating. Compare the businesses with 2-3 stars to the businesses with 4-5 stars and answer the following questions. Include your code.
	
i. Do the two groups you chose to analyze have a different distribution of hours?


ii. Do the two groups you chose to analyze have a different number of reviews?
         
         
iii. Are you able to infer anything from the location data provided between these two groups? Explain.

SQL code used for analysis:

		
		
2. Group business based on the ones that are open and the ones that are closed. What differences can you find between the ones that are still open and the ones that are closed? List at least two differences and the SQL code you used to arrive at your answer.
		
i. Difference 1:
         
         
ii. Difference 2:
         
         
         
SQL code used for analysis:

	
	
3. For this last part of your analysis, you are going to choose the type of analysis you want to conduct on the Yelp dataset and are going to prepare the data for analysis.

Ideas for analysis include: Parsing out keywords and business attributes for sentiment analysis, clustering businesses to find commonalities or anomalies between them, predicting the overall star rating for a business, predicting the number of fans a user will have, and so on. These are just a few examples to get you started, so feel free to be creative and come up with your own problem you want to solve. Provide answers, in-line, to all of the following:
	
i. Indicate the type of analysis you chose to do:
         
         
ii. Write 1-2 brief paragraphs on the type of data you will need for your analysis and why you chose that data:
                           
                  
iii. Output of your finished dataset:
         
         
iv. Provide the SQL code you used to create your final dataset:

In [ ]:

1. Pick one city and category of your choice and group the businesses in that city or category by their overall star rating. Compare the businesses with 2-3 stars to the businesses with 4-5 stars and answer the following questions. Include your code.
	




i. Do the two groups you chose to analyze have a different distribution of hours?
yes

ii. Do the two groups you chose to analyze have a different number of reviews?
yes , the numbers of reviewfor (2-3) stars is higher than 4-5 stars 


SELECT SUM(num_reviews) , category FROM
(SELECT  b.id , b.name , b.city , b.stars , b.review_count AS num_reviews ,
h.hours AS hours ,
CASE WHEN b.stars >= 2.0 AND b.stars <= 3.0 THEN '2-3 Stars'
     WHEN b.stars >= 4.0 AND b.stars <= 5.0 THEN '4-5 Stars'
     ELSE 'OTHER'
     END AS category
FROM business AS b
JOIN hours AS h
ON b.id = h.business_id
WHERE b.city = 'Toronto')
GROUP BY category


+------------------+-----------+
| SUM(num_reviews) | category  |
+------------------+-----------+
|             1015 | 2-3 Stars |
|              954 | 4-5 Stars |
|               60 | OTHER     |
+------------------+-----------+

         
         
iii. Are you able to infer anything from the location data provided between these two groups? Explain.

Toronto | 169 Niagara Street has more  number of reviews and higher number of stars 


SELECT b.name , b.city , b.address , b.state , b.stars , b.review_count AS num_reviews ,
h.hours AS hours ,
CASE WHEN b.stars >= 2.0 AND b.stars <= 3.0 THEN '2-3 Stars'
     WHEN b.stars >= 4.0 AND b.stars <= 5.0 THEN '4-5 Stars'
     ELSE 'OTHER'
     END AS category
FROM business AS b
JOIN hours AS h
ON b.id = h.business_id
WHERE b.city = 'Toronto'
GROUP BY category

+--------------------+---------+---------------------+-------+-------+-------------+----------------------+-----------+
| name               | city    | address             | state | stars | num_reviews | hours                | category  |
+--------------------+---------+---------------------+-------+-------+-------------+----------------------+-----------+
| The Fox & Fiddle   | Toronto | 535 Danforth Ave    | ON    |   2.5 |          35 | Saturday|10:00-2:00  | 2-3 Stars |
| Edulis             | Toronto | 169 Niagara Street  | ON    |   4.0 |          89 | Saturday|18:00-23:00 | 4-5 Stars |
| The Charlotte Room | Toronto | 19 Charlotte Street | ON    |   3.5 |          10 | Saturday|18:00-2:00  | OTHER     |
+--------------------+---------+---------------------+-------+-------+-------------+----------------------+-----------+

In [ ]:
1) first query 

SELECT  id , name , city , stars , review_count , 
CASE WHEN stars >= 2.0 AND stars <= 3.0 THEN '2-3 Stars'
     WHEN stars >= 4.0 AND stars <= 5.0 THEN '4-5 Stars'
     ELSE 'OTHER'
     END AS category
FROM business
WHERE city = 'Toronto'


2) 

SELECT  b.id , b.name , b.city , b.stars , b.review_count , h.hours ,
CASE WHEN b.stars >= 2.0 AND b.stars <= 3.0 THEN '2-3 Stars'
     WHEN b.stars >= 4.0 AND b.stars <= 5.0 THEN '4-5 Stars'
     ELSE 'OTHER'
     END AS category
FROM business AS b
JOIN hours AS h
ON b.id = h.business_id
WHERE b.city = 'Toronto'

In [ ]:
2. Group business based on the ones that are open and the ones that are closed. What differences can you find between the ones that are still open and the ones that are closed? List at least two differences and the SQL code you used to arrive at your answer.
		
i. Difference 1:
         number of reviews and stars are higher when the it is still open 
         
ii. Difference 2:
 - buisness that located at neighborhood has a is_open = 1 more than is_open = 0
  that mean the location in neighborhood has a good effect in the state of the buisness 
         
         
         
SQL code used for analysis:



1) 
SELECT is_open , SUM(stars) AS num_stars , SUM(review_count) AS num_reviews
FROM business 
GROUP BY is_open 

+---------+-----------+-------------+
| is_open | num_stars | num_reviews |
+---------+-----------+-------------+
|       0 |    5351.0 |       35261 |
|       1 |   31198.0 |      269300 |
+---------+-----------+-------------+


2)
SELECT city , state , SUM(stars) , SUM(review_count) , is_open
FROM business
WHERE is_open = 1
GROUP BY city
ORDER BY SUM(review_count) DESC


+-----------------+-------+------------+-------------------+---------+
| city            | state | SUM(stars) | SUM(review_count) | is_open |
+-----------------+-------+------------+-------------------+---------+
| Las Vegas       | NV    |     4968.0 |             72264 |       1 |
| Phoenix         | AZ    |     3103.5 |             30251 |       1 |
| Toronto         | ON    |     2820.0 |             20078 |       1 |
| Scottsdale      | AZ    |     1666.5 |             18781 |       1 |
| Charlotte       | NC    |     1425.5 |             11033 |       1 |
| Henderson       | NV    |      890.5 |             10172 |       1 |
| Tempe           | AZ    |      813.5 |              9258 |       1 |
| Montréal        | QC    |     1042.0 |              8713 |       1 |
| Pittsburgh      | PA    |     1129.0 |              8661 |       1 |
| Chandler        | AZ    |      698.0 |              6609 |       1 |
| Gilbert         | AZ    |      647.0 |              6050 |       1 |
| Mesa            | AZ    |      941.5 |              5779 |       1 |
| Cleveland       | OH    |      583.5 |              5123 |       1 |
| Madison         | WI    |      562.0 |              4836 |       1 |
| Glendale        | AZ    |      576.5 |              3976 |       1 |
| Mississauga     | ON    |      464.0 |              3481 |       1 |
| Peoria          | AZ    |      381.5 |              2483 |       1 |
| North Las Vegas | NV    |      187.5 |              2305 |       1 |
| Edinburgh       | EDH   |      711.5 |              2216 |       1 |
| Markham         | ON    |      214.0 |              2078 |       1 |
| Champaign       | IL    |      211.5 |              1905 |       1 |
| Stuttgart       | BW    |      476.5 |              1715 |       1 |
| Lakewood        | OH    |      109.0 |              1380 |       1 |
| Surprise        | AZ    |      184.5 |              1379 |       1 |
| Goodyear        | AZ    |      136.5 |              1121 |       1 |
+-----------------+-------+------------+-------------------+---------+
(Output limit exceeded, 25 of 351 total rows shown)



SELECT city , state , SUM(stars) , SUM(review_count) , is_open
FROM business
WHERE is_open = 0
GROUP BY city
ORDER BY SUM(review_count) DESC


+-------------------+-------+------------+-------------------+---------+
| city              | state | SUM(stars) | SUM(review_count) | is_open |
+-------------------+-------+------------+-------------------+---------+
| Las Vegas         | NV    |      875.0 |             10590 |       0 |
| Phoenix           | AZ    |      540.0 |              4252 |       0 |
| Toronto           | ON    |      672.5 |              4035 |       0 |
| Scottsdale        | AZ    |      300.0 |              1833 |       0 |
| Chandler          | AZ    |      154.0 |              1503 |       0 |
| Charlotte         | NC    |      247.5 |              1490 |       0 |
| Tempe             | AZ    |      158.5 |              1246 |       0 |
| Pittsburgh        | PA    |      213.5 |              1137 |       0 |
| Mesa              | AZ    |      152.5 |              1096 |       0 |
| Montréal          | QC    |      193.0 |               735 |       0 |
| Henderson         | NV    |      132.5 |               699 |       0 |
| Edinburgh         | EDH   |      196.5 |               576 |       0 |
| Cleveland         | OH    |      108.0 |               470 |       0 |
| Glendale          | AZ    |       90.0 |               430 |       0 |
| Madison           | WI    |       86.5 |               429 |       0 |
| Mississauga       | ON    |       49.5 |               333 |       0 |
| Gilbert           | AZ    |       79.0 |               330 |       0 |
| Markham           | ON    |       48.5 |               274 |       0 |
| Cornelius         | NC    |       18.0 |               215 |       0 |
| Cleveland Heights | OH    |       14.0 |               175 |       0 |
| Paradise Valley   | AZ    |        4.0 |               169 |       0 |
| Richmond Hill     | ON    |       36.5 |               146 |       0 |
| Peoria            | AZ    |       16.0 |               141 |       0 |
| Surprise          | AZ    |       36.0 |               141 |       0 |
| Stuttgart         | BW    |       61.0 |               134 |       0 |
+-------------------+-------+------------+-------------------+---------+



ii) 
SELECT name , neighborhood , is_open , stars , SUM(review_count)
FROM business 
WHERE is_open  = 0
GROUP BY  neighborhood

(Output limit exceeded, 25 of 168 total rows shown)


SELECT name , neighborhood , is_open , stars , SUM(review_count)
FROM business 
WHERE is_open  = 1
GROUP BY  neighborhood

(Output limit exceeded, 25 of 280 total rows shown)

In [ ]:



Ideas for analysis include: Parsing out keywords and business attributes for sentiment analysis, clustering businesses to find commonalities or anomalies between them, predicting the overall star rating for a business, predicting the number of fans a user will have, and so on. These are just a few examples to get you started, so feel free to be creative and come up with your own problem you want to solve. Provide answers, in-line, to all of the following:
	
i. Indicate the type of analysis you chose to do:
         sentiment analysis
         
ii. Write 1-2 brief paragraphs on the type of data you will need for your analysis and why you chose that data:
 i need a text data from the user that include reviews about the business with key words that indicate is it a positive or negative review also a rating column and number of people who did this review , also is it still open or not 
                           
                  
iii. Output of your finished dataset:
- the more the LENGTH of the review text the more it indicates to complement

         
iv. Provide the SQL code you used to create your final dataset:

SELECT LENGTH(text) , text FROM review 



SELECT r.business_id , SUM(r.stars) , r.cool , r.funny , r.useful 
FROM review As r 
JOIN business AS b 
ON b.id = r.business_id
GROUP BY r.business_id


+------------------------+--------------+------+-------+--------+
| business_id            | SUM(r.stars) | cool | funny | useful |
+------------------------+--------------+------+-------+--------+
| --9e1ONYQuAa-CB_Rrw7Tw |           17 |    0 |     1 |      1 |
| --cZ6Hhc9F7VkKXxHMVZSQ |            6 |    0 |     0 |      0 |
| -050d_XIor1NpCuWkbIVaQ |            5 |    0 |     0 |      1 |
| -0NrB58jqKqJfuUCDupcsw |            1 |    0 |     0 |      1 |
| -0tgMGl7D9B10YjSN2ujLA |            4 |    3 |     2 |      2 |
| -1UMR00eXtwaeh59pEiDjA |            2 |    0 |     0 |      0 |
| -1xuC540Nycht_iWFeJ-dw |            3 |    0 |     0 |      0 |
| -2TKoFglMQvSmHSNWf6S8Q |            3 |    0 |     0 |      0 |
| -2uhc4spgMqJMy0YSxConA |            5 |    0 |     0 |      0 |
| -38Kck4mGlkBwd6OXayZRg |            5 |    0 |     0 |      0 |
| -3QHAylnVB-vNmCg2Rf5aw |            5 |    0 |     0 |      1 |
| -3zffZUHoY8bQjGfPSoBKQ |            9 |    0 |     0 |      1 |
| -5L8zOxibac-vBrsYtxXbQ |            5 |    0 |     0 |      0 |
| -5NXoZeGBdx3Bdk70tuyCw |            5 |    0 |     0 |      1 |
| -5TBEK1ddM41v_gqGm5oyw |            5 |    0 |     0 |      2 |
| -6tvduBzjLI1ISfs3F_qTg |            4 |    0 |     0 |      0 |
| -7H-oXvCxJzuT42ky6Db0g |            6 |    0 |     0 |      0 |
| -7PX_FOoCwktlunImRyZdg |            5 |    0 |     0 |      0 |
| -82Z0wTA-nOCLUVD4XXIBA |            1 |    0 |     0 |      0 |
| -8O8sVCnaIKHP-596zN9UA |            1 |    0 |     1 |      5 |
| -8QlV3b_9H4BAh6LgMIr1g |            5 |    1 |     0 |      1 |
| -8ZiMXZReeTD3kwEvS0Lww |            5 |    0 |     0 |      0 |
| -92cC6-X87HQ1DE1UHOx3w |            1 |    0 |     2 |      2 |
| -95mbLJsa0CxXhpaNL4LvA |            5 |    3 |     1 |      2 |
| -9YyInW1wapzdNZrhQJ9dg |            7 |    0 |     0 |      0 |
+------------------------+--------------+------+-------+--------+
(Output limit exceeded, 25 of 507 total rows shown)

In [ ]:

SELECT r.business_id , SUM(r.stars) , r.cool , r.funny , r.useful , 
SUM(b.review_count) AS rev_count , b.is_open , b.city 
FROM review As r 
JOIN business AS b 
ON b.id = r.business_id
WHERE is_open = 1
GROUP BY b.city
ORDER BY rev_count DESC 



+------------------------+--------------+------+-------+--------+-----------+---------+-----------------+
| business_id            | SUM(r.stars) | cool | funny | useful | rev_count | is_open | city            |
+------------------------+--------------+------+-------+--------+-----------+---------+-----------------+
| 36RlO3r8oRzojGXxqD6-dA |          636 |    0 |     0 |      1 |     97669 |       1 | Las Vegas       |
| 38tScZkvRLoa5h-wNPyjkw |          206 |    0 |     0 |      0 |     10401 |       1 | Phoenix         |
| 3188t5PMa_XLlah-2UBRoA |          141 |    0 |     0 |      1 |     10060 |       1 | Scottsdale      |
| 2KWkeOk1KaH50Es_A-8cnA |           57 |    0 |     0 |      1 |      9813 |       1 | Gilbert         |
| 35lDiS--Zx-8HLwv2EZBGQ |          114 |    0 |     1 |      0 |      6652 |       1 | Henderson       |
| 35SEr0cPTuoBJ1DYQ686pA |          153 |    0 |     0 |      1 |      6524 |       1 | Toronto         |
| 2NpoKiship3R6lqexwbFVw |           63 |    0 |     0 |      1 |      5649 |       1 | Montréal        |
| 366FaRQ1MWEHBhaEKTcriQ |          108 |    0 |     0 |      0 |      4360 |       1 | Tempe           |
| 36GvUjLg3drdOB3jgpqTOQ |           74 |    0 |     0 |      3 |      3383 |       1 | Chandler        |
| 3-HFGxmbzSax-NySJ_LzDg |           61 |    0 |     0 |      1 |      2721 |       1 | Madison         |
| 2S6p5ICNswz_EdgcZk76qQ |           57 |    1 |     0 |      2 |      2475 |       1 | Charlotte       |
| 2AM9rlnUE8chfYHzetRJMA |           38 |    0 |     0 |      1 |      2306 |       1 | Cleveland       |
| 2wCzZUwcqRRBrAtBBYxnog |           72 |    0 |     0 |      0 |      2273 |       1 | Pittsburgh      |
| 2g6x4ISNiMxFnotBuwmZmw |           45 |    0 |     0 |      0 |      1470 |       1 | Mesa            |
| 0EeciPtb--c42OUE7Nm9mg |            8 |    0 |     0 |      0 |      1462 |       1 | Mississauga     |
| 309bnXTHirKMU6wz1HwRjQ |           20 |    0 |     0 |      2 |      1220 |       1 | Lakewood        |
| 2fqHO2vFbcwVV27c_Irm8Q |           19 |    1 |     1 |      1 |      1004 |       1 | North Las Vegas |
| 2W3bij9DEFbuwVvSqXYicw |           14 |    0 |     0 |      0 |       551 |       1 | Glendale        |
| 2NICrHy0I5rlEJmlt0ao9A |           14 |    0 |     0 |      0 |       537 |       1 | Cave Creek      |
| 1jt4SuIHAtXD9aPnPqZ3BQ |           14 |    0 |     0 |      0 |       504 |       1 | Champaign       |
| -_yAaFHx0e1ZqmuHTtqnFA |           12 |    0 |     0 |      2 |       338 |       1 | Surprise        |
| 3-i1qd64K-WLo0fJ5wrbbw |           14 |    0 |     0 |      0 |       327 |       1 | North York      |
| 2tHWNuSOkKCpRdEVLaRGmA |           10 |    0 |     0 |      0 |       296 |       1 | Markham         |
| 2tE_n3ws4Vn1byejSZZIsQ |            7 |    0 |     0 |      0 |       294 |       1 | Avondale        |
| -R2kwt0qMnzwEdAfXPvkXg |            1 |    0 |     0 |      1 |       264 |       1 | Monroeville     |
+------------------------+--------------+------+-------+--------+-----------+---------+-----------------+
(Output limit exceeded, 25 of 62 total rows shown)